#Использовать ".."

// Базовый тест на работу библиотеки. Требует наличия ссылки на репозиторий в lib OneScript

// Процедура-обработчик описания оповещения.
//
Процедура СообщитьПриветМир(Результат, ДополнительныеПараметры = Неопределено) Экспорт
    Сообщить("Привет, " + ДополнительныеПараметры + "!");
    ВызватьИсключение "Что-то произошло!";
КонецПроцедуры

// Процедура-обработчик ошибки.
//
Процедура ОбработкаОшибки(ИнформацияОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
    Сообщить("Шеф, усё пропало!");
    Сообщить("Информация об ошибке: " + ИнформацияОбОшибке);
КонецПроцедуры

ОписаниеОповещения = ОписанияОповещений.Создать("СообщитьПриветМир", ЭтотОбъект, "Мир", "ОбработкаОшибки", ЭтотОбъект);

Попытка
    ОписанияОповещений.ВыполнитьОбработкуОповещения(ОписаниеОповещения);
Исключение
КонецПопытки;

ОписаниеОповещения = Новый ОписаниеОповещения("СообщитьПриветМир", ЭтотОбъект, "Мир", "ОбработкаОшибки", ЭтотОбъект);

Попытка
    ОписанияОповещений.ВыполнитьОбработкуОповещения(ОписаниеОповещения);
Исключение
КонецПопытки;
